; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 7733)
	(= (fuel plane1) 829)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city5)
	(= (capacity plane2) 10765)
	(= (fuel plane2) 3767)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 15)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at person1 city3)
	(at person2 city1)
	(at person3 city4)
	(at person4 city7)
	(at person5 city7)
	(at person6 city2)
	(at person7 city0)
	(at person8 city6)
	(at person9 city5)
	(at person10 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 841)
	(= (distance city0 city2) 654)
	(= (distance city0 city3) 503)
	(= (distance city0 city4) 671)
	(= (distance city0 city5) 905)
	(= (distance city0 city6) 787)
	(= (distance city0 city7) 651)
	(= (distance city1 city0) 841)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 567)
	(= (distance city1 city3) 817)
	(= (distance city1 city4) 516)
	(= (distance city1 city5) 711)
	(= (distance city1 city6) 868)
	(= (distance city1 city7) 612)
	(= (distance city2 city0) 654)
	(= (distance city2 city1) 567)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 973)
	(= (distance city2 city4) 528)
	(= (distance city2 city5) 509)
	(= (distance city2 city6) 586)
	(= (distance city2 city7) 818)
	(= (distance city3 city0) 503)
	(= (distance city3 city1) 817)
	(= (distance city3 city2) 973)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 612)
	(= (distance city3 city5) 857)
	(= (distance city3 city6) 708)
	(= (distance city3 city7) 522)
	(= (distance city4 city0) 671)
	(= (distance city4 city1) 516)
	(= (distance city4 city2) 528)
	(= (distance city4 city3) 612)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 836)
	(= (distance city4 city6) 872)
	(= (distance city4 city7) 975)
	(= (distance city5 city0) 905)
	(= (distance city5 city1) 711)
	(= (distance city5 city2) 509)
	(= (distance city5 city3) 857)
	(= (distance city5 city4) 836)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 716)
	(= (distance city5 city7) 743)
	(= (distance city6 city0) 787)
	(= (distance city6 city1) 868)
	(= (distance city6 city2) 586)
	(= (distance city6 city3) 708)
	(= (distance city6 city4) 872)
	(= (distance city6 city5) 716)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 901)
	(= (distance city7 city0) 651)
	(= (distance city7 city1) 612)
	(= (distance city7 city2) 818)
	(= (distance city7 city3) 522)
	(= (distance city7 city4) 975)
	(= (distance city7 city5) 743)
	(= (distance city7 city6) 901)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city4)
	(at person2 city2)
	(at person3 city6)
	(at person4 city5)
	(at person5 city0)
	(at person6 city0)
	(at person7 city2)
	(at person8 city7)
	(at person9 city4)
	(at person10 city2)
	))

(:metric minimize (+ (* 4 (total-time))  (* 5 (total-fuel-used))))
)

; plan
1. (board person9 plane2 city5)
   deleted: (at person9 city5)
   added: (in person9 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 0 of 10
2. (fly plane2 city5 city3)
   deleted: (at plane2 city5)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 0 to 3428, (fuel plane2) from 3767 to 339
   goals met: 0 of 10
3. (refuel plane2 city3)
   changed: (fuel plane2) from 339 to 10765
   goals met: 0 of 10
4. (fly plane2 city3 city2)
   deleted: (at plane2 city3)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 3428 to 7320, (fuel plane2) from 10765 to 6873
   goals met: 0 of 10
5. (board person6 plane2 city2)
   deleted: (at person6 city2)
   added: (in person6 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 0 of 10
6. (fly plane2 city2 city0)
   deleted: (at plane2 city2)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 7320 to 9936, (fuel plane2) from 6873 to 4257
   goals met: 0 of 10
7. (debark person6 plane2 city0)
   deleted: (in person6 plane2)
   added: (at person6 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 1 of 10
8. (board person7 plane2 city0)
   deleted: (at person7 city0)
   added: (in person7 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 1 of 10
9. (fly plane2 city0 city7)
   deleted: (at plane2 city0)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 9936 to 12540, (fuel plane2) from 4257 to 1653
   goals met: 1 of 10
10. (refuel plane2 city7)
   changed: (fuel plane2) from 1653 to 10765
   goals met: 1 of 10
11. (board person4 plane2 city7)
   deleted: (at person4 city7)
   added: (in person4 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 1 of 10
12. (board person5 plane2 city7)
   deleted: (at person5 city7)
   added: (in person5 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 1 of 10
13. (fly plane2 city7 city2)
   deleted: (at plane2 city7)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 12540 to 15812, (fuel plane2) from 10765 to 7493
   goals met: 1 of 10
14. (debark person7 plane2 city2)
   deleted: (in person7 plane2)
   added: (at person7 city2)
   changed: (onboard plane2) from 4 to 3
   goals met: 2 of 10
15. (fly plane2 city2 city3)
   deleted: (at plane2 city2)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 15812 to 19704, (fuel plane2) from 7493 to 3601
   goals met: 2 of 10
16. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 2 of 10
17. (fly plane2 city3 city6)
   deleted: (at plane2 city3)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 19704 to 22536, (fuel plane2) from 3601 to 769
   goals met: 2 of 10
18. (board person8 plane2 city6)
   deleted: (at person8 city6)
   added: (in person8 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 2 of 10
19. (refuel plane2 city6)
   changed: (fuel plane2) from 769 to 10765
   goals met: 2 of 10
20. (fly plane2 city6 city5)
   deleted: (at plane2 city6)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 22536 to 25400, (fuel plane2) from 10765 to 7901
   goals met: 2 of 10
21. (debark person4 plane2 city5)
   deleted: (in person4 plane2)
   added: (at person4 city5)
   changed: (onboard plane2) from 5 to 4
   goals met: 3 of 10
22. (board person10 plane2 city5)
   deleted: (at person10 city5)
   added: (in person10 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 3 of 10
23. (fly plane2 city5 city2)
   deleted: (at plane2 city5)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 25400 to 27436, (fuel plane2) from 7901 to 5865
   goals met: 3 of 10
24. (debark person10 plane2 city2)
   deleted: (in person10 plane2)
   added: (at person10 city2)
   changed: (onboard plane2) from 5 to 4
   goals met: 4 of 10
25. (fly plane2 city2 city1)
   deleted: (at plane2 city2)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 27436 to 29704, (fuel plane2) from 5865 to 3597
   goals met: 4 of 10
26. (board person2 plane2 city1)
   deleted: (at person2 city1)
   added: (in person2 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 4 of 10
27. (fly plane2 city1 city0)
   deleted: (at plane2 city1)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 29704 to 33068, (fuel plane2) from 3597 to 233
   goals met: 4 of 10
28. (debark person5 plane2 city0)
   deleted: (in person5 plane2)
   added: (at person5 city0)
   changed: (onboard plane2) from 5 to 4
   goals met: 5 of 10
29. (refuel plane2 city0)
   changed: (fuel plane2) from 233 to 10765
   goals met: 5 of 10
30. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 33068 to 35684, (fuel plane2) from 10765 to 8149
   goals met: 5 of 10
31. (debark person2 plane2 city2)
   deleted: (in person2 plane2)
   added: (at person2 city2)
   changed: (onboard plane2) from 4 to 3
   goals met: 6 of 10
32. (fly plane2 city2 city7)
   deleted: (at plane2 city2)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 35684 to 38956, (fuel plane2) from 8149 to 4877
   goals met: 6 of 10
33. (debark person8 plane2 city7)
   deleted: (in person8 plane2)
   added: (at person8 city7)
   changed: (onboard plane2) from 3 to 2
   goals met: 7 of 10
34. (fly plane2 city7 city4)
   deleted: (at plane2 city7)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 38956 to 42856, (fuel plane2) from 4877 to 977
   goals met: 7 of 10
35. (debark person9 plane2 city4)
   deleted: (in person9 plane2)
   added: (at person9 city4)
   changed: (onboard plane2) from 2 to 1
   goals met: 8 of 10
36. (debark person1 plane2 city4)
   deleted: (in person1 plane2)
   added: (at person1 city4)
   changed: (onboard plane2) from 1 to 0
   goals met: 9 of 10
37. (board person3 plane2 city4)
   deleted: (at person3 city4)
   added: (in person3 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 9 of 10
38. (refuel plane2 city4)
   changed: (fuel plane2) from 977 to 10765
   goals met: 9 of 10
39. (fly plane2 city4 city6)
   deleted: (at plane2 city4)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 42856 to 46344, (fuel plane2) from 10765 to 7277
   goals met: 9 of 10
40. (debark person3 plane2 city6)
   deleted: (in person3 plane2)
   added: (at person3 city6)
   changed: (onboard plane2) from 1 to 0
   goals met: 10 of 10
